#### SectionType Enumeration

---

|  |
| --- |
| See Also |

Declares the section data type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum SectionType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SectionType ``` |

| Visual C++ |
| --- |
| ``` public enum class SectionType ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| Header |  |
| Body |  |
| Summary |  |
| Footer |  |

# See Also

Autodesk.Revit.DB Namespace